updated readme, results
